---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAggregate.Add(Autodesk.Revit.DB.IFC.IFCData)
source: html/365233ee-4748-5127-a3e7-7c35697d99ea.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregate.Add Method

Adds an element to the aggregate.

## Syntax (C#)
```csharp
public void Add(
	IFCData ifcData
)
```

## Parameters
- **ifcData** (`Autodesk.Revit.DB.IFC.IFCData`) - The IFCData element.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The aggregate is not valid.